app/controllers/users_controller.rb

	def create
		@user = User.new(params[:user])
			if @user.save
---
INSERT INTO "users" ("created_at", "email", "encrypted_password", "salt", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?)